namespace Lesson_36
{
    // Кадровый учет продвинутый
    // HR accounting advanced

    //В функциях вы выполняли задание "Кадровый учёт"
    //Используя одну из изученных коллекций, вы смогли бы сильно себе упростить код выполненной программы, ведь у нас данные, это ФИО и позиция.
    //Поиск в данном задании не нужен.
    //1) добавить досье
    //2) вывести все досье(в одну строку через “-” фио и должность)
    //3) удалить досье
    //4) выход


    internal class Program
    {
        static void Main()
        {
        }
    }
}