namespace Lesson_35
{
    // Динамический массив продвинутый
    // Dynamic array advanced

    //В массивах вы выполняли задание "Динамический массив"
    //Используя всё изученное, напишите улучшенную версию динамического массива (не обязательно брать своё старое решение)
    //Задание нужно, чтобы вы освоились с List и прощупали его преимущество.
    //Проверка на ввод числа обязательна.
    //Пользователь вводит числа, и программа их запоминает.
    //Как только пользователь введёт команду sum, программа выведет сумму всех веденных чисел.
    //Выход из программы должен происходить только в том случае, если пользователь введет команду exit.

    internal class Program
    {
        static void Main()
        {
        }
    }
}