namespace Lesson_53
{
    internal class Program
    {
        static void Main()
        {
        }
    }
}

//Анархия в больнице
//У вас есть список больных(минимум 10 записей)
//Класс больного состоит из полей:
//ФИО,
//возраст,
//заболевание.
//Требуется написать программу больницы,
//в которой перед пользователем будет меню со следующими пунктами:
//1)Отсортировать всех больных по фио
//2)Отсортировать всех больных по возрасту
//3)Вывести больных с определенным заболеванием
//(название заболевания вводится пользователем с клавиатуры)